#拯救者——可能是迄今为止最贴心、最实用的智慧医疗系统
<center>队伍名称：虽然菜但是有猫</center>
<center>南京航空航天大学</center>
<center>王鋆玙 霍晓湘 尉凯博</center>
<center>薛方岗 汤茂行</center>
##软件设计原则
贴心、实用、美、简约
##创意来源
说实话，几乎所有人都曾经有过或未来一定会有一个人生病要死不活叫天天不应叫地地不灵的经历，本以为在这个万能的互联网时代怎么也会有一两个靠谱点的、好用点的来帮助病友走出痛苦，但是不幸的是迄今为止本小组成员没有见过一款真正以为病人解除痛苦为目的的软件（或系统），基本上当今所有能装到手机里面的医疗类软件的画风都是这样的：

<img src="/home/dmrf/HackChina2018/0.jpg" width = "250" height = "500" alt="图片名称" align=center />

而且仿佛所有医疗软件都是这一个模板出来的......
抛开其他的，试想一个正常人（更别说心理生理遭受了极大摧残的的病人了）谁会有闲心用医疗软件去看健康百科这种栏目，谁会去点击软件里面赤裸裸的商业广告，这样的软件显然不是一个正常人真正需要的医疗类软件。所以当我们看到本次大赛的主题为**智慧+**的时候，我们知道是时候利用这个机会改变这个现状了，我们立志开发一款迄今为止最**人性化**、**最实用**的智慧医疗软件系统拯救为数不多的对医疗软件还有希望的人们，所以就有了今天的主角拯救者，我知道您还有很多份文档要看，所以我尽量不写的那么晦涩难懂，希望您可以很愉快地看完这篇凝聚了5个年轻人无限创意的作品文档。
##功能介绍
直接看主UI：

<img src="/home/dmrf/HackChina2018/2.jpg" width = "250" height = "500" alt="图片名称" align=center />

我不知道您看到这个设计的第一感觉是什么，至少我在第一次从设计师手中拿到这张图的时候只有一个字：**美**，**简约温暖**才应该是一款医疗类软件应有的风格，因为我们的大多数用户是心情显然不那么好的病人，所以如果不出意外他们至少会在同样功能的前提下选择我们的软件，我知道您心里一定会觉得这个主题太过少女，其实我们根据用户的个人信息量身打造了10款不同风格的主题，而且全部是根据用户的健康状况自动设置，不需用户手动操作，虽然我们的设计师兼美工小姐姐因此一夜没睡，但是我们坚信细节决定成败，我不知道还有哪款软件能做到这么贴心（因为篇幅原因这里只贴出一张图，如需了解更多请查看我们提交的作品）。感谢完设计师我们应该正式谈谈软件的功能了，相信接下来的功能介绍会让您惊讶一群学生怎么会有这么贴心又新颖的创意，当然，在中国恐怕也只有学生能做到这一点。

###心率检测
近些年我经常看到某某程序员过度劳累猝死马桶上之类的新闻，每每看到这些我都会很悲伤，不止是因为同情他们，更怕的是自己有一天会步了前辈的后尘，死来想去终于想到了一个解决方案，如果那些有潜在突发疾病的人可以随时监测自己的心率，如果有异常可以提早进行治疗或者预防，这样一定可以大大降低突发疾病的发病率，因为大多数突发疾病只要提早发现都可避免，但是没有一个人会整天背个心率监测仪行走江湖，那样只会被当成传销，所以我们开发出了一个**不需要任何额外设备**，**仅需手机**就可**检测心率**的功能，主要原理是进入功能时，手机的闪光灯会被自动打开，用户将手指放在摄像头上时，指尖皮下血管由于有血液被压入，被光源照射的手指亮度（红色的深度）会有轻微的变化。这个过程可以凭借感光元件捕捉到。这样毛细血管的搏动就能通过画面明度的周期性变化反映出来。
相信您对这么长的原理描述一点感觉也没有，所以我还是决定给您看图：

<img src="/home/dmrf/HackChina2018/11.jpg" width = "250" height = "500" alt="图片名称" align=center />

图中可以实时显示用户的心率数值以及对应可视化的结果，很遗憾不能给您展示动态图（因为需要生成pdf），不然效果一定会让您觉得惊讶，所以如果您觉得这个想法很酷，请您在路演展示的时候一定关注我们，我们的队伍名称是：虽然菜但是有猫
###疾病诊断
听到疾病诊断这四个字我想您已经直到大概功能了，因为这个功能几乎当下所有医疗类软件都有，但是请您多看一眼我们的解决方案，因为您会觉得我们做的与众不同：
其实常见疾病自诊只需简单3步，比如我的队友某天突然感冒，这时候他很清楚自己是感冒了（一般人是不是因为诸如感冒这类常见疾病引起的不舒服的这点常识还是有的），那么在感冒到要死不活而自己又是单身狗（我相信这个比例还是很大的）没有女朋友照顾的时候的时候如何自救呢，我想我们的疾病自诊功能是个不错的选择，考虑到用户使用此功能时的身体状况，我们实在不忍心让操作过于繁琐，经过一致讨论，我们觉得3步足够了，对应到这里，就是以下3张图片：

<img src="/home/dmrf/HackChina2018/3.jpg" width = "250" height = "500" alt="图片名称" align=center />

<img src="/home/dmrf/HackChina2018/8.jpg" width = "250" height = "500" alt="图片名称" align=center />


注意，上图中的选择框不需要用患者每一个类别都选上，因为我们觉得不是所有感冒患者都那么不幸所有症状集于一身（当然如果出现这种情况我们也会给出对应的治疗方案），用户只需选择自己有的症状我们即可给出对应治疗方案，我们有理由相信这会省去用户很多麻烦。

<img src="/home/dmrf/HackChina2018/7.jpg" width = "250" height = "500" alt="图片名称" align=center />

<img src="/home/dmrf/HackChina2018/9.jpg" width = "250" height = "500" alt="图片名称" align=center />

我们根据用户症状直接给出**治疗药物建议**，而不是像大多数软件那样显示一堆用户可能的健康情况给用户，因为没有一个用户使用常用疾病诊断（注意是常用）是为了知道自己得了什么病，而是想知道如何解决，用户可以接受我们的建议购买全网最低价的药品，这些药品会从距离用户最近的药店发出，**“外卖”式**地送到用户手中，这也是我们软件的商业模式（后文会详细介绍。）
##药品说明书查询
说实话我们没有发现有一款软件具有这个功能，虽然几乎每个人都有这个需求：这个新药怎么用？它是治什么的？
一般用户可能会有查找药品说明书的冲动，但是我不知道有没有超过1%的病人喜欢从那一大坨布满了各种化学公式的夹缝里找到自己需要的信息，真的很难想象为什么没有一家制药厂商用于打破今天药品说明书难读难懂的现状。既然没有，只能我们来做了，就一张图：

<img src="/home/dmrf/HackChina2018/9.jpg" width = "250" height = "500" alt="图片名称" align=center />

我坚信上图中的信息**没有一个多余的字**，我想，这才是用户需要的。
##智能预约
我们的软件提供用户线上预约医生的功能，使用的是第三方开放的接口，虽然这个功能没有太多的创新，几乎现有所有医疗软件都有，所以这里就不再多介绍这个功能，只为节省您半分钟的阅读时间，但是我们确信用户需要。

##用药提醒
考虑到很多人有忘记吃药的现象（特别是在大病刚刚有好转就放飞自我忘记吃药的同学），如果用户通过我们的软件网购药品，我们会**自动跟踪物流**，从您收到药品起根据不同药品的服用频次为您**自动设定药品服用时间**并体前提醒您按时服药，保证您不会因为各种外界原因忘记吃药，除非用户真的放弃治疗手动关闭用药提醒。


<img src="/home/dmrf/HackChina2018/12.jpg" width = "250" height = "500" alt="图片名称" align=center />

##紧急呼救
中国目前有大量独居人士，比如空巢老人这个群体，所以出现了很多空巢老人发生突发疾病失去行动意识而身边又无人发现及时救助最终导致悲剧发生的的现象。所以我们针对独居人士（**孤寡老人、程序员**..）发生突发疾病无法发出求救信号的情况进行了人性化设计——自动紧急呼救。
当这些人一个人出现突发疾病，只需要用尽最后的力气唤醒我们的紧急呼叫功能，我们就会自动拨打120，并根据用户的地址**自动生成报警语音**播放给120或紧急联系人（正常模式下本软件会先拨打120报警，然后拨打电话联系紧急联系人，做到双保险），120急救中心可以根据紧急呼叫播放的患者地址到达现场，最大程度地保证患者的生命安全。由于功能的动态性不便贴图，具体效果请关注路演，相信您一定会被如次人性化的设计打动，我们的队名为虽然菜但是有猫。

##终极杀器之一句话解决所有问题
软件内嵌入了智能语音识别助手，使用者只需要打开语音助手**说出自己的需求**，其他一切交给软件自己，具体效果请关注路演，我们的队名为虽然菜但是有猫。
#商业模式
考虑到本软件用户的特殊性，我们认为目前大多数软件以广告推荐盈利为主的商业模式不适合此类软件，因为正常情况下不会有患者通过医疗软件上的广告购物（尽管目前大多数医疗软件都挣的是广告的钱），经过反复讨论，我们认为与药店、医院等医疗机构合作，开放“**线上医疗预定+线下外卖式医疗服务**”的盈利模式是最适合本软件的商业模式，比如接入线上外卖式药物购买的模式等。



